In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("dsp.csv")
print(data)

    serial no month  days
0           1   jan    31
1           2   feb    29
2           3   mar    31
3           4   apr    30
4           5   may    31
5           6   jun    30
6           7   jul    31
7           8   aug    31
8           9   sep    30
9          10   oct    31
10         11   nov    31
11         12   dec    31

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   serial no  12 non-null     int64
 1   month      12 non-null     object
 2   days       12 non-null     int64
dtypes: int64(2), object(1)
memory usage: 416.0+ bytes

In [4]:
data.head()

   serial no month  days
0          1   jan    31
1          2   feb    29
2          3   mar    31
3          4   apr    30
4          5   may    31

In [5]:
data.tail()

    serial no month  days
7           8   aug    31
8           9   sep    30
9          10   oct    31
10         11   nov    31
11         12   dec    31

In [6]:
data.head(7)

   serial no month  days
0          1   jan    31
1          2   feb    29
2          3   mar    31
3          4   apr    30
4          5   may    31
5          6   jun    30
6          7   jul    31

In [7]:
data.tail(10)

    serial no month  days
2           3   mar    31
3           4   apr    30
4           5   may    31
5           6   jun    30
6           7   jul    31
7           8   aug    31
8           9   sep    30
9          10   oct    31
10         11   nov    31
11         12   dec    31

In [8]:
data["serial no"].max()

12

In [9]:
data["serial no"].min()

1

In [10]:
data[data["serial no"]>8]

    serial no month  days
8           9   sep    30
9          10   oct    31
10         11   nov    31
11         12   dec    31

In [11]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [12]:
data[data["serial no"]>6]

    serial no month  days
6           7   jul    31
7           8   aug    31
8           9   sep    30
9          10   oct    31
10         11   nov    31
11         12   dec    31

In [13]:
data.describe()

       serial no       days
count  12.000000  12.000000
mean    6.500000  30.583333
std     3.605551   0.668558
min     1.000000  29.000000
25%     3.750000  30.000000
50%     6.500000  31.000000
75%     9.250000  31.000000
max    12.000000  31.000000

In [14]:
data.count()

serial no    12
month        12
days         12
dtype: int64

In [15]:
data.max()

serial no     12
month        sep
days          31
dtype: object

In [16]:
data.min()

serial no      1
month        apr
days          29
dtype: object

In [17]:
data.loc[1]

serial no      2
month        feb
days          29
Name: 1, dtype: object

In [18]:
data.loc[7,"month"]

'aug'

In [26]:
data.to_excel("rec.xlsx",sheet_name="s1")
data=pd.read_excel("rec.xlsx")
data

    Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1  serial no month  days  holidays
0            0             0               0          1   jan    31        10
1            1             1               1          2   feb    29         3
2            2             2               2          3   mar    31         5
3            3             3               3          4   apr    30         3
4            4             4               4          5   may    31         6
5            5             5               5          6   jun    30         4
6            6             6               6          7   jul    31         3
7            7             7               7          8   aug    31         4
8            8             8               8          9   sep    30         7
9            9             9               9         10   oct    31         9
10          10            10              10         11   nov    31         5
11          11            11              11         12   dec    31         4

In [20]:
data["holidays"]=["10","3","5","3","6","4","3","4","7","9","5","4"]
print(data)

    Unnamed: 0  serial no month  days holidays
0            0          1   jan    31       10
1            1          2   feb    29        3
2            2          3   mar    31        5
3            3          4   apr    30        3
4            4          5   may    31        6
5            5          6   jun    30        4
6            6          7   jul    31        3
7            7          8   aug    31        4
8            8          9   sep    30        7
9            9         10   oct    31        9
10          10         11   nov    31        5
11          11         12   dec    31        4

In [21]:
a=data.loc[0:,"month"]
print(a)

0     jan
1     feb
2     mar
3     apr
4     may
5     jun
6     jul
7     aug
8     sep
9     oct
10    nov
11    dec
Name: month, dtype: object

In [22]:
a=data.loc[4:7,"month"]
print(a)

4    may
5    jun
6    jul
7    aug
Name: month, dtype: object

In [23]:
data["holidays"]

0     10
1      3
2      5
3      3
4      6
5      4
6      3
7      4
8      7
9      9
10     5
11     4
Name: holidays, dtype: object

In [24]:
p=data.holidays[1:4],data.month[1:4]
print(p)

(1    3
2    5
3    3
Name: holidays, dtype: object, 1    feb
2    mar
3    apr
Name: month, dtype: object)